In [3]:
import pandas as pd

In [8]:
# Reading from a CSV file only 2 columns and ignore others

In [10]:
ufo = pd.read_csv("http://bit.ly/uforeports")

In [12]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [15]:
ufo = pd.read_csv("http://bit.ly/uforeports", usecols=['City','State'])
ufo.columns

Index(['City', 'State'], dtype='object')

In [17]:
# Fastest Method to Read from CSV File and Define Type of Each Column before Reading the CSV File

In [ ]:
# Not sure what he meant but this is a fast method for reading large dataframes

In [19]:
ufo = pd.read_csv("http://bit.ly/uforeports",nrows=3) # will only read 3 rows
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

In [20]:
# How do DataFrames and Series work with regard to selecting individual entries and iteration (for X in userdata:)

In [22]:
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke

In [24]:
# iterating through a dataFrame:
for index, row in ufo.iterrows():
    print(index,row.City,row.State) #printing 2 series from the row

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

In [26]:
# What is the best way to drop every non-numeric column from a DataFrame?
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [28]:
# here we have all the different data type and we want to drop non-numeric columns like object
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [31]:
# As you can see by the result we dropped country which had a data type of object (non-numeric)
import numpy as np
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [33]:
# Questions on how to use the describe and include function
drinks.describe(include=['object','float64']) # will only include these types
# drinks.describe(include=['object']) this will also work

        country  total_litres_of_pure_alcohol continent
count       193                    193.000000       193
unique      193                           NaN         6
top     Ireland                           NaN    Africa
freq          1                           NaN        53
mean        NaN                      4.717098       NaN
std         NaN                      3.773298       NaN
min         NaN                      0.000000       NaN
25%         NaN                      1.300000       NaN
50%         NaN                      4.200000       NaN
75%         NaN                      7.200000       NaN
max         NaN                     14.400000       NaN

In [34]:
drinks.describe(include=['object'])

        country continent
count       193       193
unique      193         6
top     Ireland    Africa
freq          1        53